lib/ws/search_contact_full.xml.erb

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://guidewire.com/ws/soapheaders" xmlns:abc="http://guidewire.com/ab/ws/gw/webservice/ab/ab700/abcontactapi/ABContactAPI" xmlns:abc1="http://guidewire.com/ab/ws/gw/webservice/ab/ab700/abcontactapi/ABContactSearchCriteriaInfo" xmlns:add="http://guidewire.com/ab/ws/gw/webservice/ab/ab700/abcontactapi/AddressSearchInfo" xmlns:prox="http://guidewire.com/ab/ws/gw/webservice/ab/ab700/abcontactapi/ProximitySearchParametersInfo" xmlns:abc2="http://guidewire.com/ab/ws/gw/webservice/ab/ab700/abcontactapi/ABContactAPISearchSpecInfo" xmlns:abc3="http://guidewire.com/ab/ws/gw/webservice/ab/ab700/abcontactapi/ABContactSearchSortColumnInfo" xmlns:abc4="http://guidewire.com/ab/ws/gw/webservice/ab/ab700/abcontactapi/ABContactAPISubtypeFilter" xmlns:abc5="http://guidewire.com/ab/ws/gw/webservice/ab/ab700/abcontactapi/ABContactAPITagMatcher">
   <soapenv:Header>
      <soap:locale>en_AU</soap:locale>
      <soap:authentication>
         <soap:username>su</soap:username>
         <soap:password>gw</soap:password>
      </soap:authentication>
   </soapenv:Header>
   <soapenv:Body>
      <abc:searchContact>
         <!--Optional:-->
         <abc:abContactSearchCriteriaInfo>
            <abc1:ContactType>Home Service Provider</abc1:ContactType>
            <abc1:OrganizationName>4 Dimensions Building Contractors</abc1:OrganizationName>
            <!--Optional:-->
            <abc1:ABN_Ext>?</abc1:ABN_Ext>
            <!--Optional:-->
            <abc1:Address>
               <!--Optional:-->
               <add:City>?</add:City>
               <!--Optional:-->
               <add:Country>?</add:Country>
               <!--Optional:-->
               <add:PostalCode>?</add:PostalCode>
               <!--Optional:-->
               <add:State>?</add:State>
            </abc1:Address>
            <!--Optional:-->
            <abc1:AdjudicativeDomain>?</abc1:AdjudicativeDomain>
            <!--Optional:-->
            <abc1:AllTagsRequired>?</abc1:AllTagsRequired>
            <!--Optional:-->
            <abc1:AttorneySpecialty>?</abc1:AttorneySpecialty>
            <!--Optional:-->
            <abc1:BankAccountNumber>?</abc1:BankAccountNumber>
            <!--Optional:-->
            <abc1:BankRoutingNumber>?</abc1:BankRoutingNumber>
            <!--Optional:-->
            <abc1:CGU_EC_RepositoryID>?</abc1:CGU_EC_RepositoryID>
            <!--Optional:-->
            <abc1:CGU_EC_SpecialityFilter_1>?</abc1:CGU_EC_SpecialityFilter_1>
            <!--Optional:-->
            <abc1:ContactType>Home Service Provider</abc1:ContactType>
            <!--Optional:-->
            <abc1:DI_Active>?</abc1:DI_Active>
            <!--Optional:-->
            <abc1:DI_AllHomeSpeciality>?</abc1:DI_AllHomeSpeciality>
            <!--Optional:-->
            <abc1:DI_ContactRelationship>?</abc1:DI_ContactRelationship>
            <!--Optional:-->
            <abc1:DI_HomeSpeciality>?</abc1:DI_HomeSpeciality>
            <!--Optional:-->
            <abc1:DI_IsHomeStoreCrdtActive>?</abc1:DI_IsHomeStoreCrdtActive>
            <!--Optional:-->
            <abc1:DI_NotificationMechanism>?</abc1:DI_NotificationMechanism>
            <!--Optional:-->
            <abc1:DoctorSpecialty>?</abc1:DoctorSpecialty>
            <!--Optional:-->
            <abc1:EmailAddress1>?</abc1:EmailAddress1>
            <!--Optional:-->
            <abc1:EmployeeNumber>?</abc1:EmployeeNumber>
            <!--Optional:-->
            <abc1:FaxPhone>?</abc1:FaxPhone>
            <!--Optional:-->
            <abc1:FirstName>?</abc1:FirstName>
            <!--Optional:-->
            <abc1:Keyword>?</abc1:Keyword>
            <!--Optional:-->
            <abc1:LawFirmSpecialty>?</abc1:LawFirmSpecialty>
            <!--Optional:-->
            <abc1:MedicalOrgSpecialty>?</abc1:MedicalOrgSpecialty>
            <!--Optional:-->
            <abc1:OrganizationName>4 Dimensions Building Contractors</abc1:OrganizationName>
            <!--Optional:-->
            <abc1:PreferredVendors>?</abc1:PreferredVendors>
            <!--Optional:-->
            <abc1:ProximitySearchCenter>
               <!--Optional:-->
               <add:City>?</add:City>
               <!--Optional:-->
               <add:Country>?</add:Country>
               <!--Optional:-->
               <add:PostalCode>?</add:PostalCode>
               <!--Optional:-->
               <add:State>?</add:State>
            </abc1:ProximitySearchCenter>
            <!--Optional:-->
            <abc1:ProximitySearchParameters>
               <!--Optional:-->
               <prox:CorrectedSearchCenter>?</prox:CorrectedSearchCenter>
               <!--Optional:-->
               <prox:DistanceBasedSearch>?</prox:DistanceBasedSearch>
               <!--Optional:-->
               <prox:GeocodeStatus>?</prox:GeocodeStatus>
               <!--Optional:-->
               <prox:HTMID>?</prox:HTMID>
               <!--Optional:-->
               <prox:Latitude>?</prox:Latitude>
               <!--Optional:-->
               <prox:Longitude>?</prox:Longitude>
               <!--Optional:-->
               <prox:Number>?</prox:Number>
               <!--Optional:-->
               <prox:SavedSearchCenter>?</prox:SavedSearchCenter>
               <!--Optional:-->
               <prox:UnitOfDistance>?</prox:UnitOfDistance>
            </abc1:ProximitySearchParameters>
            <!--Optional:-->
            <abc1:PublicID>?</abc1:PublicID>
            <!--Optional:-->
            <abc1:Score>?</abc1:Score>
            <!--Optional:-->
            <abc1:Tags>
               <!--Zero or more repetitions:-->
               <abc1:Entry>?</abc1:Entry>
            </abc1:Tags>
            <!--Optional:-->
            <abc1:TaxID>?</abc1:TaxID>
            <!--Optional:-->
            <abc1:VendorType>?</abc1:VendorType>
            <!--Optional:-->
            <abc1:WorkPhone>?</abc1:WorkPhone>
         </abc:abContactSearchCriteriaInfo>
         <!--Optional:-->
         <abc:abContactAPISearchSpecInfo>
            <!--Optional:-->
            <abc2:ChunkSize>?</abc2:ChunkSize>
            <!--Optional:-->
            <abc2:ExcludeTotal>?</abc2:ExcludeTotal>
            <!--Optional:-->
            <abc2:GetNumResultsOnly>?</abc2:GetNumResultsOnly>
            <!--Optional:-->
            <abc2:SortColumns>
               <!--Zero or more repetitions:-->
               <abc2:Entry>
                  <!--Optional:-->
                  <abc3:Ascending>?</abc3:Ascending>
                  <!--Optional:-->
                  <abc3:BeanPath>?</abc3:BeanPath>
               </abc2:Entry>
            </abc2:SortColumns>
            <!--Optional:-->
            <abc2:StartRow>?</abc2:StartRow>
            <!--Optional:-->
            <abc2:SubtypeFilter>
               <!--Optional:-->
               <abc4:Subtypes>
                  <!--Zero or more repetitions:-->
                  <abc4:Entry>?</abc4:Entry>
               </abc4:Subtypes>
            </abc2:SubtypeFilter>
            <!--Optional:-->
            <abc2:TagMatcher>
               <abc5:MatchAllTags>?</abc5:MatchAllTags>
               <!--Optional:-->
               <abc5:Tags>
                  <!--Zero or more repetitions:-->
                  <abc5:Entry>?</abc5:Entry>
               </abc5:Tags>
            </abc2:TagMatcher>
         </abc:abContactAPISearchSpecInfo>
      </abc:searchContact>
   </soapenv:Body>
</soapenv:Envelope>